pschatzmann/ESP32-A2DP/src/BluetoothA2DPSource.cpp
      } else if (a2d->conn_stat.state ==
                 ESP_A2D_CONNECTION_STATE_DISCONNECTED) {
        s_a2d_state = APP_AV_STATE_UNCONNECTED;
      }
      break;
    }
    case ESP_A2D_AUDIO_STATE_EVT:
    case ESP_A2D_AUDIO_CFG_EVT:
    case ESP_A2D_MEDIA_CTRL_ACK_EVT:
      // if we got here -> we must be still connected
      // This is called when we request to reconnect
      s_a2d_state = APP_AV_STATE_CONNECTED;
      esp_a2d_media_ctrl(ESP_A2D_MEDIA_CTRL_CHECK_SRC_RDY);
      break;
    case BT_APP_HEART_BEAT_EVT:
      // we might be still active
      esp_a2d_media_ctrl(ESP_A2D_MEDIA_CTRL_CHECK_SRC_RDY);
      /**
       * Switch state to APP_AV_STATE_UNCONNECTED
       * when connecting lasts more than 2 heart beat intervals.
       */
      if (++s_connecting_heatbeat_count >= 2) {
        s_a2d_state = APP_AV_STATE_UNCONNECTED;
        s_connecting_heatbeat_count = 0;
      }
      break;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
    case ESP_A2D_REPORT_SNK_DELAY_VALUE_EVT: {
      esp_a2d_cb_param_t *a2d = (esp_a2d_cb_param_t *)(param);
      (void) a2d; // prevent unused variable warning
      ESP_LOGI(BT_AV_TAG, "%s, delay value: %u * 1/10 ms", __func__,
               a2d->a2d_report_delay_value_stat.delay_value);
      break;
    }
#endif
    default:
      ESP_LOGW(BT_AV_TAG, "%s unhandled event: %d", __func__, event);
      break;
  }
}

void BluetoothA2DPSource::bt_app_av_state_connected_hdlr(uint16_t event,
                                                         void *param) {
  ESP_LOGD(BT_AV_TAG, "%s evt %d", __func__, event);
  esp_a2d_cb_param_t *a2d = nullptr;

  /* handle the events of intrest in connected state */
  switch (event) {
    case ESP_A2D_CONNECTION_STATE_EVT: {
      a2d = (esp_a2d_cb_param_t *)(param);
      if (a2d->conn_stat.state == ESP_A2D_CONNECTION_STATE_DISCONNECTED) {
        ESP_LOGI(BT_AV_TAG, "a2dp disconnected");
        s_a2d_state = APP_AV_STATE_UNCONNECTED;
      }
      break;
    }
    case ESP_A2D_AUDIO_STATE_EVT: {
      a2d = (esp_a2d_cb_param_t *)(param);
      if (ESP_A2D_AUDIO_STATE_STARTED == a2d->audio_stat.state) {
        s_pkt_cnt = 0;
      }
      break;
    }
    case ESP_A2D_AUDIO_CFG_EVT:
      // not suppposed to occur for A2DP source
      break;
    case ESP_A2D_MEDIA_CTRL_ACK_EVT:
    case BT_APP_HEART_BEAT_EVT: {
      bt_app_av_media_proc(event, param);
      break;
    }
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
    case ESP_A2D_REPORT_SNK_DELAY_VALUE_EVT: {
      esp_a2d_cb_param_t *a2d = (esp_a2d_cb_param_t *)(param);
      (void) a2d; // prevent unused variable warning
      ESP_LOGI(BT_AV_TAG, "%s, delay value: %u * 1/10 ms", __func__,
               a2d->a2d_report_delay_value_stat.delay_value);
      break;
    }
#endif
    default: {
      ESP_LOGW(BT_AV_TAG, "%s unhandled event: %d", __func__, event);
      break;
    }
  }
}

void BluetoothA2DPSource::bt_app_av_state_disconnecting_hdlr(uint16_t event,
                                                             void *param) {
  ESP_LOGD(BT_AV_TAG, "%s evt %d", __func__, event);
  esp_a2d_cb_param_t *a2d = nullptr;

  /* handle the events of intrest in disconnecing state */
  switch (event) {
    case ESP_A2D_CONNECTION_STATE_EVT: {
      a2d = (esp_a2d_cb_param_t *)(param);
      if (a2d->conn_stat.state == ESP_A2D_CONNECTION_STATE_DISCONNECTED) {
        ESP_LOGI(BT_AV_TAG, "a2dp disconnected");
        s_a2d_state = APP_AV_STATE_UNCONNECTED;
      }
      break;
    }
    case ESP_A2D_AUDIO_STATE_EVT:
    case ESP_A2D_AUDIO_CFG_EVT:
    case ESP_A2D_MEDIA_CTRL_ACK_EVT:
    case BT_APP_HEART_BEAT_EVT:
      ESP_LOGW(BT_AV_TAG, "Events unprocessed");
      break;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0)
    case ESP_A2D_REPORT_SNK_DELAY_VALUE_EVT: {
      esp_a2d_cb_param_t *a2d = (esp_a2d_cb_param_t *)(param);
      (void) a2d; // prevent unused variable warning
      ESP_LOGI(BT_AV_TAG, "%s, delay value: 0x%u * 1/10 ms", __func__,
               a2d->a2d_report_delay_value_stat.delay_value);
      break;
    }
#endif
    default: {
      ESP_LOGW(BT_AV_TAG, "%s unhandled event: %d", __func__, event);
      break;
    }
  }
}

void BluetoothA2DPSource::bt_app_av_media_proc(uint16_t event, void *param) {
  ESP_LOGD(BT_AV_TAG, "%s evt %d", __func__, event);
  esp_a2d_cb_param_t *a2d = nullptr;
  switch (s_media_state) {
    case APP_AV_MEDIA_STATE_IDLE: {
      if (event == BT_APP_HEART_BEAT_EVT) {
        ESP_LOGI(BT_AV_TAG, "a2dp media ready checking ...");
        esp_a2d_media_ctrl(ESP_A2D_MEDIA_CTRL_CHECK_SRC_RDY);
      } else if (event == ESP_A2D_MEDIA_CTRL_ACK_EVT) {
        a2d = (esp_a2d_cb_param_t *)(param);
        if (a2d->media_ctrl_stat.cmd == ESP_A2D_MEDIA_CTRL_CHECK_SRC_RDY &&
            a2d->media_ctrl_stat.status == ESP_A2D_MEDIA_CTRL_ACK_SUCCESS) {
          ESP_LOGI(BT_AV_TAG, "a2dp media ready, starting ...");
          esp_a2d_media_ctrl(ESP_A2D_MEDIA_CTRL_START);
          s_media_state = APP_AV_MEDIA_STATE_STARTING;
        }
      }
      break;
    }
    case APP_AV_MEDIA_STATE_STARTING: {
      if (event == ESP_A2D_MEDIA_CTRL_ACK_EVT) {
        a2d = (esp_a2d_cb_param_t *)(param);
        if (a2d->media_ctrl_stat.cmd == ESP_A2D_MEDIA_CTRL_START &&
            a2d->media_ctrl_stat.status == ESP_A2D_MEDIA_CTRL_ACK_SUCCESS) {
          ESP_LOGI(BT_AV_TAG, "a2dp media start successfully.");
          s_intv_cnt = 0;
          s_media_state = APP_AV_MEDIA_STATE_STARTED;
        } else {
          // not started succesfully, transfer to idle state
          ESP_LOGI(BT_AV_TAG, "a2dp media start failed.");
          s_media_state = APP_AV_MEDIA_STATE_IDLE;
        }
      }
      break;
    }

    case APP_AV_MEDIA_STATE_STARTED: {
      ESP_LOGI(BT_AV_TAG, "a2dp media started");
      break;
    }

    case APP_AV_MEDIA_STATE_STOPPING: {
      if (event == ESP_A2D_MEDIA_CTRL_ACK_EVT) {
        a2d = (esp_a2d_cb_param_t *)(param);
        if (a2d->media_ctrl_stat.cmd == ESP_A2D_MEDIA_CTRL_STOP &&
            a2d->media_ctrl_stat.status == ESP_A2D_MEDIA_CTRL_ACK_SUCCESS) {
          ESP_LOGI(BT_AV_TAG,
                   "a2dp media stopped successfully, disconnecting...");
          s_media_state = APP_AV_MEDIA_STATE_IDLE;
          esp_a2d_source_disconnect(peer_bd_addr);
          s_a2d_state = APP_AV_STATE_DISCONNECTING;
        } else {
          ESP_LOGI(BT_AV_TAG, "a2dp media stopping...");
          esp_a2d_media_ctrl(ESP_A2D_MEDIA_CTRL_STOP);
        }
      }
      break;
    }
  }
}

void BluetoothA2DPSource::app_rc_ct_callback(esp_avrc_ct_cb_event_t event,
                                          esp_avrc_ct_cb_param_t *param) {
  ESP_LOGD(BT_RC_CT_TAG, "%s evt %d", __func__, event);
  switch (event) {
    case ESP_AVRC_CT_CONNECTION_STATE_EVT:
    case ESP_AVRC_CT_PASSTHROUGH_RSP_EVT:
    case ESP_AVRC_CT_METADATA_RSP_EVT:
    case ESP_AVRC_CT_CHANGE_NOTIFY_EVT:
    case ESP_AVRC_CT_REMOTE_FEATURES_EVT:
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
    case ESP_AVRC_CT_GET_RN_CAPABILITIES_RSP_EVT:
    case ESP_AVRC_CT_SET_ABSOLUTE_VOLUME_RSP_EVT:
#endif
    {
      bt_app_work_dispatch(ccall_bt_av_hdl_avrc_ct_evt, event, param,
                           sizeof(esp_avrc_ct_cb_param_t), nullptr);
      break;
    }
    default: {
      ESP_LOGW(BT_RC_CT_TAG, "Unhandled AVRC event: %d", event);
      break;
    }
  }
}

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)

